Public Attributes | List of all members
API_AnalyticalLinkType Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Link. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_AnalyticalLink_Settings  | linkSettings
The Analytical Link settings.
 API_AnalyticalMemberPartRef  | startElementPartRef
The Analytical Member reference on one side.
 API_AnalyticalMemberPartRef  | endElementPartRef
The Analytical Member reference on the other side.
Detailed Description
Describes a Structural Analytical Model Analytical Link.
Since
Archicad 25